Revit 2024 API
DisplacementElement Class
 A view-specific element that causes other elements to appear to be displaced from their actual locations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class DisplacementElement : Element
Visual Basic
Public Class DisplacementElement _
	Inherits Element
Visual C++
public ref class DisplacementElement : public Element
Remarks
The DisplacementElement does not actually change the location of any model elements; it merely causes them to be displayed in a different location.
An element may only be displaced by a single DisplacementElement in any view. Assigning an element to more than one DisplacementElement is an error condition.
A DisplacementElement can declare another DisplacementElement as its parent. In that case, its transform will be concatenated with that of the parent, and the displacement of its associated elements will be relative to the parent DisplacementElement.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DisplacementElement
See Also
DisplacementElement Members
Autodesk.Revit.DB Namespace